rp3595686/ultifeeder_esp32/src/main.cpp
//Time settings
struct tm timeinfo;
char strTime[51];
bool timeNotObtained = false;

//JSON settings
StaticJsonDocument<192> Doc;
String sendJson;

// Used variable
float voltage, phValue, temperature = 25;
int noFoodCount = 0;
bool isFoodLeft = false;
bool isFoodStuckDetectStart = false;
bool isFoodStuck = false;

// Pins
const int motor1pin1 = 33;
const int motor1pin2 = 25;
const int topIRpin = 13;
const int buttomIRpin = 12;

float readTemperature()
{
  // add your code here to get the temperature from your temperature sensor
  sensors.requestTemperatures();
  return sensors.getTempCByIndex(0);
}

void showOnLcd()
{
  Gpu_CoCmd_Dlstart(phost);
  App_WrCoCmd_Buffer(phost, CLEAR(1, 1, 1));
  Gpu_CoCmd_Text(phost, 30, 55, 29, 0, "pH Level:");
  Gpu_CoCmd_Text(phost, 30, 121, 29, 0, "Temperature:");
  Gpu_CoCmd_Number(phost, 200, 55, 29, 0, int(phValue));
  Gpu_CoCmd_Number(phost, 200, 121, 29, 0, int(temperature));
  App_WrCoCmd_Buffer(phost, GPU_DISPLAY());
  Gpu_CoCmd_Swap(phost);
  App_Flush_Co_Buffer(phost);
  Gpu_Hal_WaitCmdfifo_empty(phost);
}

void sendRequest(uint16_t index)
{
	static bool requestOpenResult;

	reqCount[index]--;
	readySend[index] = false;
  Serial.print("Request::");
  Serial.println(index);

	requestOpenResult = request[index].open("POST", addreses[index][reqCount[index]]);

	if (requestOpenResult)
	{
		// Only send() if open() returns true, or crash
		Serial.print("\nSending request: ");
		request[index].send(sendJson);
	}
	else
	{
		Serial.print("\nCan't send bad request : ");
	}

	Serial.println(addreses[index][reqCount[index]]);
}

void sendRequest0()
{
	sendRequest(0);
}

void sendRequest1()
{
	sendRequest(1);
}

void sendRequests()
{
	for (int index = 0; index < NUM_DIFFERENT_SITES; index++)
	{
		reqCount[index] = 2;
	}

	reqCount[0] = NUM_ENTRIES_SITE_0;
	reqCount[1] = NUM_ENTRIES_SITE_1;
}

void requestCB0(void *optParm, AsyncHTTPSRequest *thisRequest, int readyState)
{
	(void) optParm;

	if (readyState == readyStateDone)
	{
		AHTTPS_LOGDEBUG0(F("\n**************************************\n"));
		AHTTPS_LOGDEBUG1(F("Response Code = "), thisRequest->responseHTTPString());

		if (thisRequest->responseHTTPcode() == 200)
		{
			Serial.println(F("\n**************************************"));
			Serial.println(thisRequest->responseText());
			Serial.println(F("**************************************"));
		}

		thisRequest->setDebug(false);
		readySend[0] = true;
	}
}

void requestCB1(void *optParm, AsyncHTTPSRequest *thisRequest, int readyState)
{
	(void) optParm;

	if (readyState == readyStateDone)
	{
		AHTTPS_LOGDEBUG0(F("\n**************************************\n"));
		AHTTPS_LOGDEBUG1(F("Response Code = "), thisRequest->responseHTTPString());

		if (thisRequest->responseHTTPcode() == 200)
		{
			Serial.println(F("\n**************************************"));
			Serial.println(thisRequest->responseText());
			Serial.println(F("**************************************"));
		}

		thisRequest->setDebug(false);
		readySend[1] = true;
	}
}

String getTime()
{
  if (!getLocalTime(&timeinfo))
  { // if did not get time
    Serial.println("Failed to obtain time");
    return "Failed to obtain time";
  }
  else
  {
    // Serial.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
    strftime(strTime, 50, "%Y-%m-%d %H:%M:%S", &timeinfo);
    return strTime;
  }
}

void setup()
{
  Serial.begin(115200);

  foodFeed_startMillis = millis();      // initial start time
  readTemp_startMillis = millis(); // initial start time

  pinMode(motor1pin1, OUTPUT);
  pinMode(motor1pin2, OUTPUT);
  //myservo.attach(motor1pin1);
  pinMode(32, OUTPUT);
  pinMode(LEDR, OUTPUT);
  pinMode(topIRpin, INPUT);
  pinMode(buttomIRpin, INPUT);

  // Controlling spin direction of motors:
  digitalWrite(motor1pin1, HIGH);
  digitalWrite(motor1pin2, LOW);
  analogWrite(32, 255); // ENA pin`

  EEPROM.begin(32); // needed EEPROM.begin to store calibration k in eeprom
  //ph.begin();
  //sensors.begin();
  //ads.setGain(GAIN_ONE);
  //ads.begin();

  // LCD Setup
  phost = &host;
  /* Init HW Hal */
  App_Common_Init(&host);

  
	// put your setup code here, to run once:
  Serial.begin(115200);

  while (!Serial && millis() < 5000);

  delay(200);

  Serial.print(F("\nStarting Ultifeeder using "));
  Serial.print(FS_Name);
  Serial.print(F(" on "));
  Serial.println(ARDUINO_BOARD);
  Serial.println(ESP_ASYNC_WIFIMANAGER_VERSION);
  Serial.println(ASYNC_HTTPS_REQUEST_GENERIC_VERSION);
  Serial.println(ESP_DOUBLE_RESET_DETECTOR_VERSION);

#if defined(ESP_ASYNC_WIFIMANAGER_VERSION_INT)

  if (ESP_ASYNC_WIFIMANAGER_VERSION_INT < ESP_ASYNC_WIFIMANAGER_VERSION_MIN)
  {
    Serial.print(F("Warning. Must use this example on Version later than : "));
    Serial.println(ESP_ASYNC_WIFIMANAGER_VERSION_MIN_TARGET);
  }

#endif

#if defined(ASYNC_HTTPS_REQUEST_GENERIC_VERSION_MIN)

  if (ASYNC_HTTPS_REQUEST_GENERIC_VERSION_INT < ASYNC_HTTPS_REQUEST_GENERIC_VERSION_MIN)
  {
    Serial.print(F("Warning. Must use this example on Version equal or later than : "));
    Serial.println(ASYNC_HTTPS_REQUEST_GENERIC_VERSION_MIN_TARGET);
  }

#endif

#ifdef ESP32

  if (!FileFS.begin(true))
#else
  if (!FileFS.begin())
#endif
  {
#ifdef ESP8266
    FileFS.format();
#endif

    Serial.println(F("SPIFFS/LittleFS failed! Already tried formatting."));

    if (!FileFS.begin())
    {
      // prevents debug info from the library to hide err message.
      delay(100);

#if USE_LITTLEFS
      Serial.println(F("LittleFS failed!. Please use SPIFFS or EEPROM. Stay forever"));
#else
      Serial.println(F("SPIFFS failed!. Please use LittleFS or EEPROM. Stay forever"));
#endif

      while (true)
      {
        delay(1);
      }
    }
  }

  drd = new DoubleResetDetector(DRD_TIMEOUT, DRD_ADDRESS);

  unsigned long startedAt = millis();

  // New in v1.4.0
  initAPIPConfigStruct(WM_AP_IPconfig);
  initSTAIPConfigStruct(WM_STA_IPconfig);
  //////

  //Local intialization. Once its business is done, there is no need to keep it around
  // Use this to default DHCP hostname to ESP8266-XXXXXX or ESP32-XXXXXX
  //ESPAsync_WiFiManager ESPAsync_wifiManager(&webServer, &dnsServer);
  // Use this to personalize DHCP hostname (RFC952 conformed)
  AsyncWebServer webServer(HTTP_PORT);

  //ESPAsync_WiFiManager ESPAsync_wifiManager(&webServer, &dnsServer, "AutoConnectAP");
#if ( USING_ESP32_S2 || USING_ESP32_C3 )
  ESPAsync_WiFiManager ESPAsync_wifiManager(&webServer, NULL, "AutoConnectAP");
#else
  AsyncDNSServer dnsServer;

  ESPAsync_WiFiManager ESPAsync_wifiManager(&webServer, &dnsServer, "AutoConnectAP");
#endif

