rp3595686/ultifeeder_esp32/src/main.cpp
    if ( WiFi.status() != WL_CONNECTED )
    {
      Serial.println(F("ConnectMultiWiFi in setup"));

      connectMultiWiFi();
    }
  }

  Serial.print(F("After waiting "));
  Serial.print((float) (millis() - startedAt) / 1000);
  Serial.print(F(" secs more in setup(), connection result is "));

  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
  }
  else
    Serial.println(ESPAsync_wifiManager.getStatus(WiFi.status()));
  
  

	for (int index = 0; index < NUM_DIFFERENT_SITES; index++)
	{
		request[index].setDebug(false);

		request[index].onReadyStateChange(requestCB[index]);
	}

  //Setting up NTP
  int ntpArrayIndex = 0;
  String strTime = "Failed to obtain time"; // default string
  while (strTime == "Failed to obtain time" && timeNotObtained == false) {
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServers[ntpArrayIndex]);
    strTime = getTime();
    if (strTime == "Failed to obtain time"){
      Serial.print("Failed to obtain time from ");
      Serial.println(ntpServers[ntpArrayIndex]);
      ntpArrayIndex++;
    }
    if(ntpArrayIndex > ntpArraySize - 1) {
      Serial.println("Failed to obtain time from all NTP Severs configured.");
      Serial.println("Data will not be sent to database.");
      timeNotObtained = true;
    }
  }
}

void loop()
{
  // Call the double reset detector loop method every so often,
  // so that it can recognise when the timeout expires.
  // You can also call drd.stop() when you wish to no longer
  // consider the next reset as a double reset.
  drd->loop();

  currentMillis = millis();

   if (currentMillis - readPh_startMillis >= readPhPeriod)
  {
    // temperature = readTemperature();                     //needed for temperature compensation below
    // voltage = analogRead(PH_PIN) / ESPADC * ESPVOLTAGE;  // read the voltage
    // Serial.println(voltage);
    // phValue = ph.readPH(voltage, temperature);  // convert voltage to pH with temperature compensation
    // phValue = random(10);
    //phValue = map(analogRead(PH_PIN), 0, 4096, 0, 14);
    phValue = random(6,8);
    Serial.print("pH:");
    Serial.println(phValue, 4);
    readPh_startMillis = currentMillis;
    showOnLcd();
    sendJson = ""; // clear string
    Doc.clear();   // release memory used by JsonObject
    if (!timeNotObtained) // Not able to configure NTP
    {
      Doc["time"] = getTime();
    }
    Doc["value"] = phValue;
    serializeJson(Doc, sendJson);
    if (readySend[0] && !timeNotObtained) // ready to send and time is configured correctly
		{
      reqCount[0] = NUM_ENTRIES_SITE_0;
			sendRequestCB[0]();
		}
  }

  if (currentMillis - readTemp_startMillis >= readTempPeriod)
  {
    temperature = random(24,27);
    //temperature = readTemperature(); // read your temperature sensor to execute temperature compensation
    Serial.print("Temperature:");
    Serial.print(temperature, 1);
    Serial.println("^C");
    readTemp_startMillis = currentMillis;
    showOnLcd();
    sendJson = ""; // clear string
    Doc.clear();   // release memory used by JsonObject
    if (!timeNotObtained) // Not able to configure NTP
    {
      Doc["time"] = getTime();
    }
    Doc["value"] = temperature;
    serializeJson(Doc, sendJson);
    if (readySend[1] && !timeNotObtained) // ready to send and time is configured correctly
		{
      reqCount[1] = NUM_ENTRIES_SITE_1;
			sendRequestCB[1]();
		}
  }
  /*
  if ((currentMillis - startMillis >= feedPeriod) && flag == true && Mode == 1)
  {
    //digitalWrite(motor1pin2, LOW);
    myservo.write(60); 
    digitalWrite(LEDR, LOW);
    flag = false;
    foodFeed_startMillis = currentMillis;
  }
  else if ((currentMillis - foodFeed_startMillis >= motorPeriod) && flag == false && Mode == 1)
  {
    //digitalWrite(motor1pin2, HIGH);
    myservo.write(0);      
    flag = true;
    foodFeed_startMillis = currentMillis;

    if (Count == 0)
      Mode = 0;

    else
      Count = 0;
  }
  else if (Mode == 0)
  {
    digitalWrite(LEDR, HIGH);
    //digitalWrite(motor1pin2, HIGH);
    myservo.write(0);   
  }*/
}